experiment-finetuned/all_finetuned/runs/wedge/1/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            waveTransmissive;
        field           T;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        1;
        lInf            1;
        value           uniform 1;
    }

    bottom
    {
        type            symmetryPlane;
    }

    top
    {
        type            waveTransmissive;
        field           T;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        1;
        lInf            1;
        value           uniform 1;
    }

    wedge
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //