experiment-finetuned/all_finetuned/runs/wedge/1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - bottom left triangle
    ( -0.15242  0        -0.005 )   // 0
    (  0.0      0        -0.005 )   // 1
    (  0.0      0.1524   -0.005 )   // 2
    ( -0.15242  0.1524   -0.005 )   // 3
    ( -0.15242  0         0.005 )   // 4
    (  0.0      0         0.005 )   // 5
    (  0.0      0.1524    0.005 )   // 6
    ( -0.15242  0.1524    0.005 )   // 7

    // Block 1 - bottom right triangle
    (  0.0      0        -0.005 )   // 8
    (  0.3048   0        -0.005 )   // 9
    (  0.3048   0.1524   -0.005 )   // 10
    (  0.0      0.1524   -0.005 )   // 11
    (  0.0      0         0.005 )   // 12
    (  0.3048   0         0.005 )   // 13
    (  0.3048   0.1524    0.005 )   // 14
    (  0.0      0.1524    0.005 )   // 15

    // Block 2 - top left triangle
    ( -0.15242  0.1524   -0.005 )   // 16
    (  0.0      0.1524   -0.005 )   // 17
    (  0.0      0.1524   -0.005 )   // 18
    ( -0.15242  0.1524   -0.005 )   // 19
    ( -0.15242  0.1524    0.005 )   // 20
    (  0.0      0.1524    0.005 )   // 21
    (  0.0      0.1524    0.005 )   // 22
    ( -0.15242  0.1524    0.005 )   // 23

    // Block 3 - top right triangle
    (  0.0      0.1524   -0.005 )   // 24
    (  0.3048   0.1524   -0.005 )   // 25
    (  0.3048   0.1524   -0.005 )   // 26
    (  0.0      0.1524   -0.005 )   // 27
    (  0.0      0.1524    0.005 )   // 28
    (  0.3048   0.1524    0.005 )   // 29
    (  0.3048   0.1524    0.005 )   // 30
    (  0.0      0.1524    0.005 )   // 31
);

blocks
(
    // Block 0 - bottom left triangle
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)

    // Block 1 - bottom right triangle
    hex (8 9 10 11 12 13 14 15) (20 10 1) simpleGrading (1 1 1)

    // Block 2 - top left triangle
    hex (16 17 18 19 20 21 22 23) (10 1 1) simpleGrading (1 1 1)

    // Block 3 - top right triangle
    hex (24 25 26 27 28 29 30 31) (20 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (8 12 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 13 14 10)
            (25 29 30 26)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
            (8 9 10 11)
        );
    }
    top
    {
        type patch;
        faces
        (
            (16 17 18 19)
            (24 25 26 27)
        );
    }
    wedge
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (17 21 22 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (8 9 13 12)
            (9 10 14 13)
            (16 17 21 20)
            (17 18 22 21)
            (24 25 29 28)
            (25 26 30 29)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //